In [1]:
import pandas as pd

In [15]:
df =pd.read_csv("userfoods.csv")

genderGrouped= df.groupby("Gender")

In [22]:
df["Gender"].unique()

array(['Female', 'Male'], dtype=object)

In [16]:
genderGrouped

In [24]:
df["Gender"].value_counts()

Female    512
Male      488
Name: Gender, dtype: int64

In [23]:
# size method give the count for grouped value
genderGrouped.size()

Gender
Female    512
Male      488
dtype: int64

In [20]:
len(genderGrouped)

2

In [19]:
genderGrouped.get_group("Male")

    First Name Gender          City Frequency       Item  Spend
1         Eric   Male      Stamford     Daily    Chalupa  10.56
2      Charles   Male      New York     Never      Sushi  42.14
5      Charles   Male      Stamford   Monthly      Sushi  93.03
6         Mark   Male  Philadelphia   Monthly  Ice Cream  30.01
7         Paul   Male  Philadelphia   Monthly    Chalupa  17.65
..         ...    ...           ...       ...        ...    ...
991    Anthony   Male      Stamford    Yearly  Ice Cream   8.72
992    Raymond   Male      New York     Never     Burger  90.32
993       Mark   Male  Philadelphia    Seldom      Donut  13.79
996     Albert   Male  Philadelphia     Daily      Sushi  72.88
999      Brian   Male      New York     Daily    Chalupa  28.36

[488 rows x 6 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  1000 non-null   object
 1   Gender      1000 non-null   object
 2   City        1000 non-null   object
 3   Frequency   1000 non-null   object
 4   Item        1000 non-null   object
 5   Spend       1000 non-null   float64
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

In [6]:
df["Spend"].mean()

50.06936999999999

In [11]:
df [ df["Gender"]=="Male" ]["Spend"].mean()

49.397622950819674

In [13]:
df [ df["Gender"]=="Female" ]["Spend"].mean()

50.70962890625

In [14]:
df [ df["Gender"]=="Male" ]

    First Name Gender          City Frequency       Item  Spend
1         Eric   Male      Stamford     Daily    Chalupa  10.56
2      Charles   Male      New York     Never      Sushi  42.14
5      Charles   Male      Stamford   Monthly      Sushi  93.03
6         Mark   Male  Philadelphia   Monthly  Ice Cream  30.01
7         Paul   Male  Philadelphia   Monthly    Chalupa  17.65
..         ...    ...           ...       ...        ...    ...
991    Anthony   Male      Stamford    Yearly  Ice Cream   8.72
992    Raymond   Male      New York     Never     Burger  90.32
993       Mark   Male  Philadelphia    Seldom      Donut  13.79
996     Albert   Male  Philadelphia     Daily      Sushi  72.88
999      Brian   Male      New York     Daily    Chalupa  28.36

[488 rows x 6 columns]

In [31]:
genderGrouped.get_group("Male")

    First Name Gender          City Frequency       Item  Spend
1         Eric   Male      Stamford     Daily    Chalupa  10.56
2      Charles   Male      New York     Never      Sushi  42.14
5      Charles   Male      Stamford   Monthly      Sushi  93.03
6         Mark   Male  Philadelphia   Monthly  Ice Cream  30.01
7         Paul   Male  Philadelphia   Monthly    Chalupa  17.65
..         ...    ...           ...       ...        ...    ...
991    Anthony   Male      Stamford    Yearly  Ice Cream   8.72
992    Raymond   Male      New York     Never     Burger  90.32
993       Mark   Male  Philadelphia    Seldom      Donut  13.79
996     Albert   Male  Philadelphia     Daily      Sushi  72.88
999      Brian   Male      New York     Daily    Chalupa  28.36

[488 rows x 6 columns]

In [27]:
genderGrouped.first()

       First Name      City Frequency     Item  Spend
Gender
Female      Wanda  Stamford    Weekly   Burger  15.66
Male         Eric  Stamford     Daily  Chalupa  10.56

In [32]:
genderGrouped.max()

       First Name      City Frequency   Item  Spend
Gender
Female      Wanda  Stamford    Yearly  Sushi  99.51
Male       Willie  Stamford    Yearly  Sushi  99.87

In [33]:
genderGrouped.min()

       First Name      City Frequency    Item  Spend
Gender
Female      Alice  New York     Daily  Burger   1.02
Male        Aaron  New York     Daily  Burger   1.26

In [34]:
genderGrouped.sum()

C:\Users\Tushar\AppData\Local\Temp\ipykernel_9236\3467305335.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  genderGrouped.sum()

           Spend
Gender
Female  25963.33
Male    24106.04

In [36]:
genderGrouped["Spend"].mean()

Gender
Female    50.709629
Male      49.397623
Name: Spend, dtype: float64

In [38]:
genderGrouped["Spend"].min()

Gender
Female    1.02
Male      1.26
Name: Spend, dtype: float64

In [41]:
df1= pd.DataFrame([ [10,20,30],[40,50,60] ])
df2 = pd.DataFrame([ ["A",80,90,100],["B",150,160,99] ])

In [42]:
df1

    0   1   2
0  10  20  30
1  40  50  60

In [59]:
df2 = pd.DataFrame([ ["A",80,90,100],["B",150,160,99] ])

In [60]:
df2

   0    1    2    3
0  A   80   90  100
1  B  150  160   99

In [45]:
pd.concat(objs=[df1,df2])

     0    1    2
0   10   20   30
1   40   50   60
0   70   80   90
1  100  150  160

In [46]:
pd.concat(objs=[df1,df2],axis=1)

    0   1   2    0    1    2
0  10  20  30   70   80   90
1  40  50  60  100  150  160

In [48]:
pd.concat(objs=[df1,df2],ignore_index=True)

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  150  160

In [51]:
df1

    0   1   2
0  10  20  30
1  40  50  60

In [52]:
df2

     0    1    2    3
0   70   80   90  100
1  100  150  160   99

In [55]:
pd.concat(objs=[df1,df2]).info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      int64
 1   1       4 non-null      int64
 2   2       4 non-null      int64
 3   3       2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 160.0 bytes

In [56]:
pd.concat(objs=[df1,df2])

     0    1    2      3
0   10   20   30    NaN
1   40   50   60    NaN
0   70   80   90  100.0
1  100  150  160   99.0

In [58]:
df1.append(df2)

C:\Users\Tushar\AppData\Local\Temp\ipykernel_9236\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

     0    1    2      3
0   10   20   30    NaN
1   40   50   60    NaN
0   70   80   90  100.0
1  100  150  160   99.0

In [ ]:
pd.concat(objs=[df1,df2],)

In [61]:
df1

    0   1   2
0  10  20  30
1  40  50  60

In [64]:
df2

   0    1    2    3
0  A   80   90  100
1  B  150  160   99

In [67]:
pd.concat(objs=[df1,df2])

    0    1    2      3
0  10   20   30    NaN
1  40   50   60    NaN
0   A   80   90  100.0
1   B  150  160   99.0

In [89]:
df1= pd.DataFrame([ [10,20,30],[40,50,60] ])
df2 = pd.DataFrame([ ["A",80,90,100]])

In [90]:
df1

    0   1   2
0  10  20  30
1  40  50  60

In [91]:
df2

   0   1   2    3
0  A  80  90  100

In [84]:
pd.concat(objs=[df1,df2],axis=0)

     A1    B1    C1   D1    D2    D3     D4
0  10.0  20.0  30.0  NaN   NaN   NaN    NaN
1  40.0  50.0  60.0  NaN   NaN   NaN    NaN
0   NaN   NaN   NaN    A  80.0  90.0  100.0

In [85]:
pd.concat(objs=[df1,df2],axis=1)

   A1  B1  C1   D1    D2    D3     D4
0  10  20  30    A  80.0  90.0  100.0
1  40  50  60  NaN   NaN   NaN    NaN

In [72]:

pd.concat(objs=[df1,df2],axis=1,)

    0   1   2    0     1     2      3
0  10  20  30    A  80.0  90.0  100.0
1  40  50  60  NaN   NaN   NaN    NaN

In [92]:
df1= pd.DataFrame([ [10,20,30],[40,50,60] ])
df2 = pd.DataFrame([ ["A",80,90,100],["B",150,160,99] ])

In [93]:
df1

    0   1   2
0  10  20  30
1  40  50  60

In [94]:
df2

   0    1    2    3
0  A   80   90  100
1  B  150  160   99

In [104]:
pd.concat(objs=[df1,df2], keys=["df1","df2"])

        0    1    2      3
df1 0  10   20   30    NaN
    1  40   50   60    NaN
df2 0   A   80   90  100.0
    1   B  150  160   99.0